<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class PermissionsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

            $permissions = [
            // المستخدمين
            'المستخدمين' => [
                'الاعدادات',
                'المستخدمين',
                'اضافة مستخدمين',
                'تعديل مستخدمين',
                'حذف مستخدمين',
                'عرض المستخدمين',
            ],

            // الصلاحيات
            'الصلاحيات' => [
                'الصلاحيات',
                'اضافة صلاحية',
                'تعديل صلاحية',
                'حذف صلاحية',
                'اعدادت السيستم',
            ],

            // الأصناف
            'الأصناف' => [
                'الاقسام',
                'اضافة صنف',
                'تعديل صنف',
                'حذف صنف',
                'عرض صنف',
            ],

            // المنتجات
            'المنتجات' => [
                'المنتجات',
                'اضافة منتج',
                'تعديل منتج',
                'حذف منتج',
                'عرض منتج',
            ],

            // الطاولات
            'الطاولات' => [
                'الطاولات',
                'اضافة طاولات',
                'تعديل طاولات',
                'حذف طاولات',
                'عرض الطاولات',
            ],

            // الحجوزات
            'الحجوزات' => [
                'الحجوزات',
                'اضافة حجوزات',
                'تعديل حجوزات',
                'حذف حجوزات',
                'عرض الحجوزات',
            ],

            // الطلبات
            'الطلبات' => [
                'الطلبات',
                'اضافة طلبات',
                'تعديل طلبات',
                'حذف طلبات',
                'عرض الطلبات',
                'تحديث حالة الطلب',
            ],

            // المطبخ
            'المطبخ' => [
                'المطبخ',
                'عرض طلبات المطبخ',
                'تحديث حالة الطلب بالمطبخ',
            ],

            // التقارير
            'التقارير' => [
                'التقارير',
                'عرض التقارير',
            ],

            // الكاشير
            'الكاشير' => [
                'الكاشير',
            ],

            // لوحة التحكم والموقع
              [
                'لوحة المسوول',
                'اسليدر الموقع',
                'الاعدادات الموقع'
            ],

            // الموقع للمطعم -
            'الموقع للمطعم' => [
            ],
        ];

        foreach ($permissions as $perm) {
            Permission::firstOrCreate([
                'name' => $perm,
                'guard_name' => 'web'
            ]);
        }
    }
}
